{"pageProps":{"slug":"begame-profile-picture-upload","frontmatter":{"date":"2020-04-15","draft":false,"secret":false,"title":"Profile picture upload for an online gaming platform","client":"Begame","role":"UX research | UX/UI design","tags":"Wireframe, User flow, UI, UX, High-fidelity design, Design system, Responsive design, Whimsical, Marvel app, Sketch, Zeplin, Jira","listVideos":true,"listImages":true},"content":"<h2>My role</h2>\n<p>UX research | UX/UI design</p>\n<h2>Duration</h2>\n<p>2 weeks</p>\n<h2>Project overview</h2>\n<p>Bingocams.co.uk is a community-driven platform where players engage in social interactions and share a passion for bingo. The objective of the project was to improve the user experience on Bingocams.co.uk by introducing personalized visual representations for players during bingo games and social interactions.\nThe goal was to implement a system that allows players to upload profile pictures, enhancing their presence in the gaming environment.\nAlso foster a more engaging and personalized experience to strengthen community connections.</p>\n<h2>Problem</h2>\n<p>Bingocams.co.uk only displayed player names during bingo games and interactions, which resulted in a lack of personalization. This absence of visual representation diminished the social experience, limiting players' ability to connect and engage meaningfully with one another during gameplay and announcements.</p>\n<h2>Impact</h2>\n<ul>\n<li>\n<p>Enhanced Personalization: Users experienced a more personalized gaming environment, allowing them to express their identities visually, which increased their sense of belonging within the community.</p>\n</li>\n<li>\n<p>Increased Engagement: The ability to display profile pictures fostered more meaningful interactions during gameplay and chat, leading to higher levels of user engagement and participation.</p>\n</li>\n<li>\n<p>Stronger Community Connections: Visual representation helped users connect with each other on a more personal level, enhancing social interactions and building a stronger sense of community among players.</p>\n</li>\n<li>\n<p>Reduced User Churn: By improving the overall user experience and making it more engaging, the platform likely saw a decrease in user churn rates, as players felt more connected and invested in the community.</p>\n</li>\n<li>\n<p>Positive Feedback: The introduction of profile pictures may have resulted in positive user feedback, contributing to a better reputation for the platform and encouraging new user registrations.</p>\n</li>\n<li>\n<p>Increased Time Spent on Platform: With a more engaging and personalized experience, users likely spent more time on the site, participating in games and interactions, which could lead to higher revenue opportunities.</p>\n</li>\n</ul>\n","images":["/works/begame-profile-picture-upload/Profile_pic_3.png","/works/begame-profile-picture-upload/Profile_pic_1.png","/works/begame-profile-picture-upload/Profile_pic_0.png"],"videos":[]},"__N_SSG":true}