{"pageProps":{"slug":"fashionTrade-virtual-showroom","frontmatter":{"date":"2019-05-18","draft":false,"title":"Digital showroom for a B2B fashiontech app","client":"fashionTrade","role":"UX research | UX/UI design","websiteURL":"https://www.fashiontrade.com/brands/digital-showroom-fashion/","tags":"Wireframe, User flows, Desktop layout, iOS app design, Sketch, Zeplin, InVision"},"content":"<h2>Project overview</h2>\n<h2>Objective</h2>\n<p>Create an digital showroom experience that enables brands to tell their stories and showcase their collections, while also helping retailers find the perfect brands for their stores.</p>\n<h2>Duration</h2>\n<p>The MVP was launched after two months, and the iteration process to improve the showroom has continued ever since.</p>\n<h2>My role</h2>\n<ul>\n<li>Analyse workshop data</li>\n<li>Develop personas and empathy map</li>\n<li>Design the end-to-end experience</li>\n<li>Write user stories</li>\n<li>Create low-fidelity wireframes, test them with users and iterate</li>\n<li>Create high-fidelity prototypes, test them with users and iterate</li>\n<li>Create desing assets and guidelines for development</li>\n</ul>\n<h2>Team</h2>\n<p>UX/UI designer(me), a product owner, the customer success team, and the development team</p>\n<h2>Problem statement</h2>\n<p>Fashion wholesalers face challenges adapting to digital-first environments, often relying on outdated, in-person sales methods that depend on spreadsheets and paper. These traditional approaches make it difficult for brands to efficiently communicate their unique stories and align with modern business practices. This lack of a digital solution restricts operational efficiency and limits the reach of brand narratives in an increasingly online marketplace.</p>\n<p>\"How might we help brands to tell their stories?\"</p>\n<p>\"How might we help retailers to find the perfect brands for their stores?\"</p>\n<h2>Goal</h2>\n<p>Our goal is to build a digital showroom experience that empowers brands to showcase their unique stories online. This will streamline processes, reduce costs, and facilitate a smooth transition to modern, digital-first operations, aligning fashion wholesalers with contemporary industry practices.</p>\n<h2>User research</h2>\n<ul>\n<li>\n<p>Workshop with brand owners - conducted by PO and lead UX/UIer</p>\n</li>\n<li>\n<p>Gather insights from workshop, understand the needs and pain points of brands.</p>\n<ol>\n<li>Insight #1: Brands need to be able to tell their stories in order to connect with the right retailers and to be able to make sales.</li>\n<li>Insight #2: Collections in the digital showroom need to be customisable based on the brand's needs.</li>\n<li>Insight #3: Brands can have multiple collection at the same time.</li>\n</ol>\n</li>\n<li>\n<p>Come up with a solution to help brands have an online presence, provide them tools that allows them to tell their stories in order to make online trading smoother.</p>\n</li>\n<li>\n<p>Usability testing, in depth testing with brand sales representatives.</p>\n</li>\n<li>\n<p>Implementation support.</p>\n</li>\n</ul>\n<h2>Results</h2>\n<p>User satisfaction\nThanks to the continuous feedback from many of the brand users during the development process, an easy to use feature has been added to the platform that made it possible for brands to be visible online.</p>\n<p>This brilliant feature allows users to access their showrooms anywhere anytime. It also gives the brand the chance to tell their story better by creating a fully branded experience using inspirational content like videos, look books, images and allowing them to link their styles to it.</p>\n<h2>Conclusion</h2>\n<p>The production of the online showroom feature was successfully achieved, it increased brand user satisfaction and demonstrated the value of user-centered design approach.</p>\n","images":["/works/fashionTrade-virtual-showroom/showroom_01.png"],"videos":[]},"__N_SSG":true}