{"pageProps":{"slug":"fashionTrade-virtual-showroom","frontmatter":{"date":"2019-05-18","draft":false,"title":"Digital showroom for B2B fashiontech app","client":"fashionTrade","role":"Design","websiteURL":"https://www.fashiontrade.com/brands/digital-showroom-fashion/","tags":"Wireframe, User flows, Desktop layout, iOS app design, Sketch, Zeplin, InVision"},"content":"<h2>Project overview</h2>\n<h2>Objective</h2>\n<p>Create an digital showroom experience that enables brands to tell their stories and showcase their collections, while also helping retailers find the perfect brands for their stores.</p>\n<h2>Duration</h2>\n<p>2 months</p>\n<h2>My role</h2>\n<ul>\n<li>Analyse workshop data</li>\n<li>Design the end-to end-experience</li>\n<li>Produce the flow/interaction prototyping, design mockups, desing assets and guidelines</li>\n</ul>\n<h2>Team</h2>\n<p>UX designer, customer success, product owner, front-end developers</p>\n<h2>Problem statement</h2>\n<p>Fashion wholesalers, unlike those in other sectors, did not embrace the digital era; instead, trade took place in person, mostly via spreadsheets and paper. This approach is inefficient in terms of time and cost. The main challenge for brands transitioning to an online trading tool was the inability to effectively tell their brand's story.</p>\n<p>\"How might we help brands to tell their stories?\"</p>\n<p>\"How might we help retailers to find the perfect brands for their stores?\"</p>\n<h2>Goal</h2>\n<p>Come up with a tool that helps brands to tell their stories and showcase their new collection in a time and cost effective way.</p>\n<h2>User research</h2>\n<ul>\n<li>\n<p>Workshop with brand owners - conducted by PO and lead UX/UIer</p>\n</li>\n<li>\n<p>Gather insights from workshop, understand the needs and pain points of brands.</p>\n<ol>\n<li>Insight #1: Brands need to be able to tell their stories in order to connect with the right retailers and to be able to make sales.</li>\n<li>Insight #2: Collections in the digital showroom need to be customisable based on the brand's needs.</li>\n<li>Insight #3: Brands can have multiple collection at the same time.</li>\n</ol>\n</li>\n<li>\n<p>Come up with a solution to help brands have an online presence, provide them tools that allows them to tell their stories in order to make online trading smoother.</p>\n</li>\n<li>\n<p>Usability testing, in depth testing with brand sales representatives.</p>\n</li>\n<li>\n<p>Implementation support.</p>\n</li>\n</ul>\n<h2>Results</h2>\n<p>User satisfaction\nThanks to the continuous feedback from many of the brand users during the development process, an easy to use feature has been added to the platform that made it possible for brands to be visible online.</p>\n<p>This brilliant feature allows users to access their showrooms anywhere anytime. It also gives the brand the chance to tell their story better by creating a fully branded experience using inspirational content like videos, look books, images and allowing them to link their styles to it.</p>\n<h2>Conclusion</h2>\n<p>The production of the online showroom feature was successfully achieved, it increased brand user satisfaction and demonstrated the value of user-centered design approach.</p>\n","images":["/works/fashionTrade-virtual-showroom/showroom_01.png"],"videos":[]},"__N_SSG":true}