{"pageProps":{"slug":"begame-design-system","frontmatter":{"date":"2020-06-15","draft":false,"secret":false,"title":"Design system for an online gaming platform","client":"Begame","role":"UI design","cover_image":"begame-design-system.png","tags":"Design system, Colour theory, UI, Accessibility, Atomic design, Responsive design, Bootstrap,  Sketch, Zeplin, Abstract"},"content":"<h2>My role</h2>\n<p>I worked closely with the front-end development team and another product designer to lead the creation and ongoing maintenance of a robust design system.</p>\n<h2>Duration</h2>\n<p>Establishing the foundation of the design system required around two months of dedicated work, and I continued to maintain and refine the system for over two years until I left the company.</p>\n<h2>Project overview</h2>\n<p>To streamline collaboration between product and development teams and ensure a cohesive visual language across the platform, I worked closely with the front-end development team and another product designer to lead the creation and ongoing maintenance of a robust design system. Built on Bootstrap, this system not only enhanced consistency in design but also allowed for faster implementation of features and smoother communication between teams. It became the backbone of our UI development, providing reusable components and design guidelines that scaled efficiently as the product evolved.</p>\n<h2>Problem</h2>\n<p>Bingocams.co.uk, the community-driven space where players engage in social interaction, share a common passion for bingo, and build connections while participating in games and events, underwent a UI refresh. The lack of a consistent and well-structured component library had made the design and implementation process inefficient, resulting in an inconsistent user experience.</p>\n<h2>Impact</h2>\n<p>The new design system streamlined collaboration between design and development teams, reducing inconsistencies and improving efficiency. This led to a more cohesive user interface, faster development cycles, and a better user experience overall. The result was a consistent platform, enhancing both usability and team productivity.</p>\n","images":["/works/begame-design-system/Design system_4.png","/works/begame-design-system/Design system_3.png","/works/begame-design-system/Design system_2.png","/works/begame-design-system/Design system_1.png"],"videos":[]},"__N_SSG":true}