{"pageProps":{"slug":"fashionTrade-virtual-showroom","frontmatter":{"date":"2019-05-18","draft":false,"title":"Digital showroom for a B2B fashiontech app","client":"fashionTrade","role":"UX research | UX/UI design","websiteURL":"https://www.fashiontrade.com/brands/digital-showroom-fashion/","tags":"Wireframe, User flows, Desktop layout, iOS app design, Sketch, Zeplin, InVision"},"content":"<h2>Project overview</h2>\n<h2>Objective</h2>\n<p>Create an digital showroom experience that enables brands to tell their stories and showcase their collections, while also helping retailers find the matching brands for their stores.</p>\n<h2>Duration</h2>\n<p>Version 1 was launched after two months</p>\n<h2>My role</h2>\n<ul>\n<li>Analysed workshop data and user interview notes</li>\n<li>Developed personas and empathy maps</li>\n<li>Crafted user stories and collaborated on user journey maps</li>\n<li>Authored the problem statement, hypothesis statement, and value proposition</li>\n<li>Defined the project’s goal statement</li>\n<li>Actively participated in brainstorming sessions (including Crazy 8s and \"How Might We\" activities)</li>\n<li>Created low-fidelity wireframes, conducted user tests, and iterated on designs</li>\n<li>Designed high-fidelity prototypes, tested with users, and made iterative improvements</li>\n<li>Developed design assets and provided guidelines for development</li>\n</ul>\n<h2>Tools</h2>\n<p>Google (docs, slides, sheets), Sketch, Zeplin, InVision, Jira</p>\n<h2>Problem statement</h2>\n<p>Fashion wholesalers struggle to adapt to digital-first environments, often relying on outdated in-person sales methods that involve spreadsheets, paper, and heavy travel burdens. These traditional approaches make it difficult for brands to efficiently communicate their unique stories and align with modern business practices. This lack of a digital solution restricts operational efficiency and limits the reach of brand narratives in an increasingly online marketplace.</p>\n<p>\"How might we help brands to tell their story?\"\n\"How might we help retailers to find the right brands for their stores?\"</p>\n<h2>Hypothesis statement</h2>\n<p>We believe that by creating a digital showroom experience tailored to the unique needs of fashion wholesalers, we can provide brands with an engaging platform that conveys their story and identity effectively online. If successful, this solution will not only streamline the sales process but will also reduce operational costs and improve brand visibility, empowering wholesalers to align with modern, digital-first business practices.</p>\n<h2>Value proposition</h2>\n<p>Our digital showroom feature offers fashion wholesalers an efficient, visually dynamic way to present their brands online, blending storytelling with ease of use. This allows wholesalers to engage buyers globally, reduce logistical burdens, and build stronger brand recognition through a seamless digital interface that supports their transition to a more sustainable and efficient digital landscape.</p>\n<h2>Goal statement</h2>\n<p>Our goal is to build a digital showroom experience that empowers brands to showcase their unique stories online. This will streamline processes, reduce costs, and facilitate a smooth transition to modern, digital-first operations, aligning fashion wholesalers with contemporary industry practices.</p>\n<h2>Wireframes</h2>\n<p>Based on the findings from the Empathize and Define stages of the process, I created low-fidelity wireframes for user validation. After several iterations, I moved on to developing high-fidelity prototypes. Throughout the process, I maintained continuous communication with the development team to address technical limitations. Once the final solution was reached, I provided design guidelines to ensure a smooth handover for the development team.</p>\n<h2>Results</h2>\n<p>Thanks to continuous feedback from brand users throughout the process, the digital brand showroom feature was successfully integrated into the platform, significantly enhancing the user experience and making it easier for brands to gain visibility online.</p>\n<p>This feature empowered brands to access their digital showrooms anytime, anywhere, while enabling them to create a fully branded experience. By using inspirational content such as videos, lookbooks, and images, brands were able to better tell their stories and connect their styles with their offerings.</p>\n<p>Additionally, retailers had a greater chance of discovering brands that aligned with their store concepts.</p>\n<p>As a result of this long-awaited feature, brand sign-ups on the platform saw a significant increase.</p>\n","images":["/works/fashionTrade-virtual-showroom/showroom_01.png"],"videos":["/works/fashionTrade-virtual-showroom/showroom_prototype_01.mp4"]},"__N_SSG":true}