{"pageProps":{"slug":"wonderkind-filtering","frontmatter":{"date":"2023-05-20","draft":false,"title":"Filtering on a B2B recruitment platform","client":"Wonderkind","role":"UX/UI design | development of components","tags":"UX/UI, Desktop layout, Design system, Figma, Vuetify, Storybook"},"content":"<h2>My role</h2>\n<p>UX/UI design | Creation of Vuetify components</p>\n<h2>Duration</h2>\n<p>1 month</p>\n<h2>Objective</h2>\n<p>To design a scalable and user-friendly filtering solution to streamline the process of creating job lists for social media campaigns, reducing the time and errors associated with manually selecting jobs.</p>\n<h2>Problem</h2>\n<p>Wonderkind users faced a time-consuming and error-prone process when creating job lists. They had to manually sift through numerous pages of jobs to select the relevant ones for social media campaigns, leading to inefficiencies.</p>\n<h2>Process</h2>\n<p>Research | Design | Validation | Handover | Storybook component</p>\n<p>I led the design process for integrating a filtering feature into the talent attraction platform, collaborating closely with the product owner and front-end lead. I developed prototypes that were reviewed and validated with real users through the customer success team. After receiving approval, I created comprehensive guidelines to facilitate a smooth handover to development and QA teams. Additionally, I contributed to building the Storybook components for the accordion elements, ensuring consistency throughout the implementation.</p>\n<h2>Impact</h2>\n<p>While the full impact of the solution could not be measured due to my departure from the company, the scalable filtering solution was expected to significantly reduce the time and effort required for job list creation. It aimed to streamline the user experience, enhance productivity, and minimize errors. By ensuring a reusable and intuitive filtering system, the project also laid the groundwork for future enhancements and consistency across Wonderkind's platform.</p>\n","images":["/works/wonderkind-filtering/wonderkind-filtering-03.png","/works/wonderkind-filtering/wonderkind-filtering-02.png","/works/wonderkind-filtering/wonderkind-filtering-01.png","/works/wonderkind-filtering/wonderkind-filtering-00.png"],"videos":["/works/wonderkind-filtering/wonderkind-filtering-09.mp4"]},"__N_SSG":true}