{"pageProps":{"slug":"wonderkind-filtering","frontmatter":{"date":"2023-05-20","draft":false,"title":"Wonderkind filtering","client":"Wonderkind","role":"Design","tags":"UX/UI, Desktop layout, Design system, Figma, Vuetify, Storybook"},"content":"<p>Working at Wonderkind, a company that has developed an innovative talent attraction technology to automate social media campaigns, I had the opportunity to engage in UX processes for a short time. During this period, I was fortunate to be assigned the task of creating a scalable and reusable filtering solution.</p>\n<h2>Problem</h2>\n<p>To create job lists for social media campaigns, a Wonderkind user must select specific jobs. This task is time-consuming and error-prone, as the user has to sift through numerous pages of jobs to manually choose the ones needed for the job list.</p>\n<h2>Objectives</h2>\n<ul>\n<li>Research enterprise filtering solutions.</li>\n<li>Find a way to give users a clear overview of their data.</li>\n<li>Design a scalable and intuitive filtering solution.</li>\n</ul>\n<h2>Goal</h2>\n<p>The main goal is to reduce time and minimise errors during the job list creation process by introducing a user-friendly, scalable, and easy-to-use filtering solution.</p>\n<h2>Impact</h2>\n<p>Unfortunately, my time at the company ended before I could see the impact of the solution.</p>\n<h2>Process</h2>\n<p>Resources<br>\nA confluence entry about the requirments,  which was written by the <a target=\"_blank\" href=\"https://nl.linkedin.com/in/feliciavanj?trk=public_post_feed-actor-name\"><em>Felicia van Jaarsveld</em></a>, one of Wonderkind's product owners.\nDesktop layout for campaigns page with filter designs proposal created by <a target=\"_blank\" href=\"https://nl.linkedin.com/in/erabykova\"><em>Ira Bykova</em></a>, the previous UXer.</p>\n<p>Research<br>\nUsing the <a target=\"_blank\" href=\"https://www.pencilandpaper.io/articles/ux-pattern-analysis-enterprise-filtering\"><em>Filter UX design pattern</em></a> article as a reference, I considered multiple filtering patterns. Ultimately, I chose the sidebar filter solution for its scalability. Since users need to see the results of each additional filter immediately, I decided against batch filtering and opted to show results per filter instead.\nIt was clear that the list of filters only will increase with time. The solution was also reusable on other page if need be.</p>\n<p>Validation<br>\nUnfortunately I did not have access to testing the solution with actual users, the PO, <a target=\"_blank\" href=\"https://nl.linkedin.com/in/feliciavanj?trk=public_post_feed-actor-name\"><em>Felicia van Jaarsveld</em></a> reviewed the user flow.</p>\n<p>Handover to dev<br>\nThis project used Vuetify components from the beginning, so I ensured that my solution consisted of Vuetify components as much as possible. I thoroughly researched the Vuetify library to identify suitable sidebar components, examine the appearance of accordions, and determine how well they could be customised to our needs.\nI have created guidlines for the dev and QA. We already had chips/pill components, which only required the addition of a remove option. I regularly checked in with our front-end lead, <a target=\"_blank\" href=\"https://nl.linkedin.com/in/oleksandr-zinchenko-phd-55526a72\"><em>Oleksandr Zinchenko</em></a>, for guidance.\nAdditionally, I had the opportunity to create the Storybook components for the collapse/accordion elements after the filtering flow was done.</p>\n","images":["/works/wonderkind-filtering/wonderkind-filtering-00.png","/works/wonderkind-filtering/wonderkind-filtering-01.png","/works/wonderkind-filtering/wonderkind-filtering-02.png"],"videos":["/works/wonderkind-filtering/wonderkind-filtering-09.mp4"]},"__N_SSG":true}