{"pageProps":{"slug":"begame-transaction-history","frontmatter":{"date":"2020-07-15","draft":false,"secret":false,"title":"Transactions for an online gaming platform","client":"Begame","role":"UX research | UX/UI design","tags":"Wireframe, User flow, UX, UI, Prototype, Responsive design, Whimsical, Marwel app, Sketch, Zeplin, Jira","listVideos":true,"listImages":true},"content":"<h2>My role</h2>\n<ul>\n<li>UX research</li>\n<li>UX/UI design</li>\n</ul>\n<h2>Tools</h2>\n<p>UserTesting.com, Whimsical, Sketch, Zeplin, BootstrapVue, Material Icons, Jira</p>\n<h2>Duration</h2>\n<p>3 X 2 week sprints</p>\n<h2>Project overview</h2>\n<p>To improve the user experience for an online gaming app, this project aimed to streamline deposit and withdrawal processes. The primary goals were to reduce overspending, lower user churn, and enhance user satisfaction with transaction clarity and accessibility.</p>\n<h2>Research</h2>\n<p>To gather insights, I conducted user research through unmoderated tests on UserTesting.com and interviewed five new users and five long-term users to identify specific pain points and expectations around transaction processes.</p>\n<h2>Key findings</h2>\n<p>While users reported that depositing and withdrawing funds were straightforward, they often felt uncertain about the transaction duration and processing times. This lack of clarity led to frequent support inquiries, creating frustration and increasing support workload.</p>\n<h2>Problem statement</h2>\n<p>Bingocams’ community members experienced challenges in obtaining a clear, organized overview of their transactions. Although the transaction processes themselves were functional, a lack of clear information led to user confusion, increased customer support inquiries, and, potentially, member attrition.</p>\n<h2>Solution</h2>\n<p>To address these challenges, I proposed a redesign of the transactions page. The updated design was intended to provide a more organized, accessible, and informative transaction experience that empowered users to track their activity confidently and independently.</p>\n<ul>\n<li>\n<p>Wireframes: I created low-fidelity wireframes to outline key layout changes, ensuring the design prioritized clarity and usability.</p>\n</li>\n<li>\n<p>High-fidelity designs: Once approved, I developed high-fidelity prototypes that visually emphasized transaction status, estimated processing times, and clear labels for each transaction type.</p>\n</li>\n<li>\n<p>Testing: I conducted usability tests with five users on UserTesting.com to validate and refine the high-fidelity prototypes.</p>\n</li>\n<li>\n<p>Design system integration: To ensure consistency, I created components for the design system and detailed guidelines to support development and QA teams.</p>\n</li>\n</ul>\n<h2>Impact</h2>\n<p>The redesigned transactions page resulted in substantial improvements across key areas:</p>\n<ul>\n<li>\n<p>Reduced support inquiries: With a clearer layout and transaction duration information, users were able to find answers independently, reducing the burden on customer support.</p>\n</li>\n<li>\n<p>Increased user satisfaction: The improved interface boosted user confidence, leading to more positive feedback and a more satisfying app experience.</p>\n</li>\n<li>\n<p>Lower user churn: By improving clarity and reducing friction, the updated transactions page supported user retention and engagement.</p>\n</li>\n<li>\n<p>Enhanced engagement: With a streamlined, accessible transaction page, users felt more comfortable engaging with the app, likely contributing to increased participation in games and events.</p>\n</li>\n<li>\n<p>Data-driven insights: The feedback collected throughout the testing and launch phases provided valuable insights for future iterations and enhancements.</p>\n</li>\n</ul>\n<h2>Reflection</h2>\n<p>This project highlighted the power of research and iterative design in resolving user pain points. By actively involving users in the testing process, we were able to make informed design choices that directly addressed their needs and expectations, enhancing both the user experience and the operational efficiency of the platform.</p>\n","images":["/works/begame-transaction-history/Transaction_04.png","/works/begame-transaction-history/Transaction_03.png","/works/begame-transaction-history/Transaction_02.png","/works/begame-transaction-history/Transaction_01.png","/works/begame-transaction-history/Transaction_00.png"],"videos":["/works/begame-transaction-history/BG_withdrawal.mp4"]},"__N_SSG":true}