{"pageProps":{"slug":"fashionTrade-virtual-showroom","frontmatter":{"date":"2019-05-18","draft":false,"title":"Digital showroom for a B2B fashiontech app","client":"fashionTrade","role":"UX research | UX/UI design","websiteURL":"https://www.fashiontrade.com/brands/digital-showroom-fashion/","tags":"Wireframe, User flows, Desktop layout, iOS app design, Sketch, Zeplin, InVision","listVideos":true,"listImages":true},"content":"<h2>Objective</h2>\n<p>Create a digital showroom experience enabling fashion brands to effectively tell their stories, showcase collections, and connect with retailers who seek brands that align with their store concepts.</p>\n<h2>Duration</h2>\n<p>The MVP of the showroom feature was launched within two months, with ongoing iterations to enhance the functionality and user experience.</p>\n<h2>My role</h2>\n<ul>\n<li>Analysed data from workshops and user interviews</li>\n<li>Developed personas and empathy maps based on user insights</li>\n<li>Authored user stories and participated in mapping user journeys</li>\n<li>Drafted the problem statement, hypothesis, and value proposition</li>\n<li>Set the project’s goal statement</li>\n<li>Engaged in brainstorming activities, including Crazy 8s and \"How Might We\" exercises</li>\n<li>Designed low-fidelity wireframes, tested with users, and iterated based on feedback</li>\n<li>Created high-fidelity prototypes, conducted further user testing, and implemented iterative improvements</li>\n<li>Produced design assets and detailed handover guidelines for the development team</li>\n</ul>\n<h2>Tools</h2>\n<p>Google Docs, Google Sheets, Sketch, Zeplin, InVision, and Jira.</p>\n<h2>Problem statement</h2>\n<p>Fashion wholesalers face challenges in adapting to digital-first environments, often relying on in-person sales supported by spreadsheets and paper. These traditional approaches lead to inefficiencies, heavy logistical costs, and difficulty in conveying brand identity in an online format. As the industry transitions to digital, brands need an effective, story-driven solution to streamline operations and improve visibility.</p>\n<h2>Key \"How Might We\" questions</h2>\n<ul>\n<li>How might we help brands effectively tell their stories?</li>\n<li>How might we enable retailers to discover brands that best suit their store concepts?</li>\n</ul>\n<h2>Hypothesis statement</h2>\n<p>By creating a digital showroom experience tailored to the needs of fashion wholesalers, we believe we can help brands share their stories and showcase their identities online. If successful, this feature will streamline sales, reduce operational costs, and enhance brand visibility, empowering wholesalers to align with modern, digital-first business practices.</p>\n<h2>Value proposition</h2>\n<p>Our digital showroom feature provides fashion wholesalers a dynamic platform to showcase their brands online. By blending storytelling with user-friendly design, this solution reduces logistical challenges, enhances global brand reach, and supports the shift to a sustainable digital environment.</p>\n<h2>Goal statement</h2>\n<p>Our goal is to develop a digital showroom experience that enables brands to convey their unique stories online, improving operational efficiency, reducing costs, and supporting a smooth transition to modern digital practices.</p>\n<h2>Process</h2>\n<ul>\n<li>\n<p>Empathize:\nI analysed the data from user interviews and workshops with fashion brands to understand their needs and pain points. Using these insights, I created empathy maps and personas to capture the motivations and challenges of our users.</p>\n</li>\n<li>\n<p>Define:\nBased on user insights, I formulated a problem statement, a hypothesis statement, and a clear value proposition, defining the need for a digital solution that supports storytelling and streamlines brand discovery for retailers.</p>\n</li>\n<li>\n<p>Ideate:\nWith the foundational insights in place, I participated in ideation sessions lead by the UX lead, including Crazy 8s and \"How Might We\" exercises, to brainstorm possible solutions. I collaborated with the team to align on a goal statement that would guide our design approach.</p>\n</li>\n<li>\n<p>Prototype:\nI created low-fidelity wireframes and validated them with users to ensure the core functionality met their needs. After several iterations based on user feedback, I moved on to high-fidelity prototypes, incorporating design elements that would enable brands to build an immersive, story-driven digital showroom.</p>\n</li>\n<li>\n<p>Test:\nThroughout the prototyping phase, I conducted continuous user testing and iterated on the designs to improve usability and user satisfaction. I also regularly communicated with the development team to address any technical constraints, ensuring a smooth transition from design to development.</p>\n</li>\n</ul>\n<h2>Results</h2>\n<p>User Satisfaction and Platform Adoption:\nWith continuous feedback from brand users, the digital brand showroom feature was successfully launched, making it easier for brands to gain online visibility.</p>\n<p>This feature empowered brands to access their showrooms anytime, anywhere, and offered tools to create a branded experience through videos, lookbooks, and images, allowing brands to better tell their stories and link their styles to product offerings.</p>\n<p>For retailers, the showroom feature made it easier to discover brands that matched their store aesthetics and needs, ultimately improving brand-retailer connections on the platform.</p>\n<p>As a result, brand sign-ups increased significantly, demonstrating the demand and effectiveness of this digital solution.</p>\n","images":["/works/fashionTrade-virtual-showroom/showroom_01.png"],"videos":["/works/fashionTrade-virtual-showroom/showroom_prototype_01.mp4"]},"__N_SSG":true}