{"pageProps":{"slug":"begame-transaction-history","frontmatter":{"date":"2021-06-15","draft":false,"secret":false,"title":"Transactions on an online gaming platform","client":"Begame","role":"Design","tags":"Wireframe, User flow, UX, UI, Responsive design, Whimsical, Marwel app, Sketch, Zeplin"},"content":"<h2>Project overview</h2>\n<ul>\n<li>\n<p>Objective <br>\nEnhance the deposit and withdrawal experience and improve the overview of all transactions for users of an online gaming app, aiming to reduce overspending and user churn while increasing user satisfaction.</p>\n</li>\n<li>\n<p>Duration <br>\n2 months</p>\n</li>\n<li>\n<p>Teams <br>\nUX team, product owner, development team</p>\n</li>\n</ul>\n<h2>Problem</h2>\n<p>When users are actively engaging with the website, there are different transactions that happen during their experience: deposits, withdrawals and different kind of game plays. Although depositing and withdrawing transactions go smoothly, members of the Bingocams community struggle to get a clear and organized overview of their transactions. This confusion often leads to complaints, which can result in losing members.</p>\n<h2>Goal</h2>\n<p>The primary goal of the project is to enhance user satisfaction by providing a smooth deposit and withdrawal experience, along with a clear and organized overview of each transaction. This will help users avoid overspending and reduce the risk of user churn.\nHow might we create an experience that allows users to stay on top of their spendings and provides them clear overview of their transactions?</p>\n<h2>Design process</h2>\n<ul>\n<li>\n<p>Competitive analysis<br>\nI analysed the transaction processes of 5 leading gaming platforms to identify best practices and common pitfalls.</p>\n</li>\n<li>\n<p>User research<br>\nWith the help of customer success team a survey was sent out to new and existing users to measure satisfaction rate and understand pain points during the current transaction processes. This survey was sent out again after the release of to improved flows.</p>\n</li>\n<li>\n<p>Design solution<br>\nWireframes: I created low-fidelity wireframes for the new deposit and withdrawal flow and for transaction overview page.<br>\nPrototypes: I develop high-fidelity, interactive prototypes to test with users.<br>\nUI design: I designed a visually appealing and accessible UI components.</p>\n</li>\n<li>\n<p>Usability testing <br>\nI set up 5 moderated and 5 unmoderated usability testing sessions with the high-fidelity prototypes to identify usability issues and gather feedback. I iterated on the design based on testing feedback to refine and improve the onboarding experience.</p>\n</li>\n<li>\n<p>Implementation support<br>\nI provided detailed design specifications and assets to the development team.\nI worked closely with developers during the implementation phase to ensure the designs are accurately translated into the final product and the helped quality assurance team with their work.</p>\n</li>\n</ul>\n<h2>Results</h2>\n<p>Metrics and evaluation</p>\n<ul>\n<li>\n<p>User satisfaction<br>\nBaseline: 4.1/5 (avarage rating from user feedback) <br>\nPost-launch: 4.6/5 <br>\nEvaluation: User satisfaction scores increased markedly, indicating that users found the new transaction overview page and the deposit and withdrawal experience much more pleasant and intuitive.</p>\n</li>\n<li>\n<p>Usability issues<br>\nBaseline: While the deposit and withdrawal flows worked smoothly, users struggled to understand the content of the transaction overview page and the status of their deposits and withdrawals. They were also limited in actions, such as canceling withdrawals.<br>\nPost-launch: No further issues were pointed out by the users in the survey.<br>\nEvaluation: By making a clear distinction in the UI between deposits, withdrawals, bingo gameplay, and casino gameplay, users had a clear understanding of their money flow. Allowing them to cancel some transactions without reaching out to customer support increased their trust in the platform.</p>\n</li>\n</ul>\n","images":["/works/begame-transaction-history/Transaction_00.png","/works/begame-transaction-history/Transaction_01.png","/works/begame-transaction-history/Transaction_02.png","/works/begame-transaction-history/Transaction_03.png","/works/begame-transaction-history/Transaction_04.png"],"videos":["/works/begame-transaction-history/BG_withdrawal.mp4"]},"__N_SSG":true}