{"pageProps":{"slug":"fashionTrade-virtual-showroom","frontmatter":{"date":"2019-05-18","draft":false,"title":"Brand showroom","client":"fashionTrade","role":"Design","websiteURL":"https://www.fashiontrade.com/brands/digital-showroom-fashion/","tags":"Wireframe, User flows, Desktop layout, iOS app design, Sketch, Zeplin, InVision"},"content":"<h2>Project overview</h2>\n<p>To simplify and digitalise fashion wholesale, the product team was entrusted with establishing an online showroom experience for brands and retailers.</p>\n<h2>Problem</h2>\n<p>The objective of fashionTrade was to simplify and digitalise wholesale trading between brands and retailers. Fashion wholesales, unlike other sectors, did not embrace the digital era; instead, trade takes place mostly via spreadsheet and paper.</p>\n<p>The purpose of this project was to provide a platform for companies to present their collections and make them available to retailers so that they could place orders without hassle.</p>\n<h2>Objectives</h2>\n<ul>\n<li>Research and observe trading behaviour.</li>\n<li>Analize sales representatives' and retailers' behaviour.</li>\n<li>Find a way to make the trading seasons fricktionless.</li>\n<li>Design a tools to be accessible and intuitive.</li>\n</ul>\n<h2>Goal</h2>\n<p>How might we create an experience that allows brands to engage and connect with retailers in order to enhance their trading season?</p>\n<h2>Needs</h2>\n<ul>\n<li>Ability for brands to create virtual showrooms to represent their seasonal collections.</li>\n<li>Ability for brands to create a retailer specific order proposal by using the iOS application's scanner tool.</li>\n<li>Ability for brands to send order proposals to retailers.</li>\n<li>Ability for retailers to adjust and/or accept order proposals.</li>\n</ul>\n<h2>Wants</h2>\n<ul>\n<li>Trade without the need of in person meetings.</li>\n<li>Boost sales on both sides.</li>\n<li>To reach retailers without forcing them to register on the platform.</li>\n</ul>\n<p>This brilliant feature allows users to access their showrooms anywhere anytime. It also gives the brand the chance to tell their story better by creating a fully branded experience using inspirational content like videos, look books, images and allowing them to link their styles to it.\nBuyers can access the brand content, scan through the upcoming collections and place orders without the need of leaving their office/store.</p>\n<p>Working closely with brand users, sales, development team and the product owner, first we needed to get to a common understanding regarding the users and market's problems: visiting showrooms was costly and time consuming. An other pain point: if a meeting happens outside of the physical showroom, sales reps need to carry a huge amount of samples to the meeting.</p>\n<p>After defining the general problem, my roles with the design team was to create prototypes and conduct user researches to get feedback about our understanding and assumptions. Based on the findings, we iterated on the user flow, validated them with sales representatives, made sure that the experience is smooth for brand and retailer users too and created an omni-channel experience.</p>\n","images":["/works/fashionTrade-virtual-showroom/showroom_01.png"],"videos":[]},"__N_SSG":true}